src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>ФИО_Принявшего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО_курьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЕденицы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РассчетСуммыПоНоменклатуре(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Сумма = Строка.Количество*Строка.ЗакупочнаяЦена;	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореНоменклатуры(Элемент,Текст, ВыбранноеЗначение, СтандартнаяОбработка)
	Номенклатура = Текст;
	Цена = NULL;
	ОбращениеКОбщемуМодулю(Номенклатура, Цена); 
	Строка = Элементы.Товары.ТекущиеДанные; 
	Строка.ЗакупочнаяЦена = Цена; 
КонецПроцедуры

&НаСервере
Процедура ОбращениеКОбщемуМодулю(Номенклатура, Цена)
	ТребуемоеЗначение = "Закупочная";
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПриРучномИзмененииЗакупочнойЦены(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Строка = Элементы.Товары.ТекущиеДанные;
	Номенклатура = Строка.Номенклатура;	Цена = NULL;
	СравнениеЦен(Номенклатура,Цена);
	
	Если Число(Текст)>Цена тогда
		Форма = ПолучитьФорму("Документ.ПриходнаяНакладная.Форма.ПроЗакупочнуюЦену");
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СравнениеЦен(Номенклатура,Цена)
	ТребуемоеЗначение = "Розничная";
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Итог = 0;
	Для каждого элемент из Объект.Товары Цикл
		Сумма = Элемент.Сумма;
		Итог = Сумма+Итог;	
		
	КонецЦикла;
	
	
	Объект.ИтоговаяСумма = Итог;	
	Итог = 0
КонецПроцедуры
